# Используем официальный образ Python
FROM python:3.9-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости
# --no-cache-dir чтобы не хранить кэш и уменьшить размер образа
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы проекта в рабочую директорию
COPY . .

# Открываем порт, на котором будет работать приложение (8080 используется многими платформами)
EXPOSE 8080

# Команда для запуска приложения при старте контейнера
# Увеличиваем timeout до 300 секунд, чтобы дать решателю время на работу
# Используем shell-форму CMD, чтобы переменная окружения ${PORT} правильно подставлялась
CMD gunicorn --workers 2 --timeout 500 --bind 0.0.0.0:${PORT:-8080} app:app

