# Используем официальный образ Python
FROM python:3.9-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости
# --no-cache-dir чтобы не хранить кэш и уменьшить размер образа
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы проекта в рабочую директорию
COPY . .

# Открываем порт, на котором будет работать приложение (8080 используется многими платформами)
EXPOSE 8081

# Команда для запуска приложения при старте контейнера
# Используем переменную окружения PORT, если она задана, иначе 8080
# Правильная команда: ищем объект app в файле app.py
# Используем shell-форму CMD, чтобы переменная окружения ${PORT} правильно подставлялась
CMD gunicorn --workers 2 --bind 0.0.0.0:${PORT:-8081} app:app

