# Используем официальный образ Python
FROM python:3.9-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /solver

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости
# --no-cache-dir чтобы не хранить кэш и уменьшить размер образа
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы проекта в рабочую директорию
COPY . .

# Открываем порт, на котором будет работать Gunicorn
EXPOSE 5000

# Команда для запуска приложения при старте контейнера
# Запускаем Gunicorn с 2 воркерами, биндим на все IP-адреса на порту 5000
# app:app означает: из файла app.py взять объект с именем app
CMD ["gunicorn", "--workers", "2", "--bind", "0.0.0.0:5000", "solver:solver"]
